In [1]:
# ðŸ”¹ Exercise 13:
#  Add a revenue column = price * quantity.
#  Map product categories to short codes ("Beverages" â†’ "BEV").

In [2]:
import pandas as pd
import numpy as np

In [8]:
df= pd.DataFrame({"price":[20,30,40] , "Quantity":[2,3,4] ,"categoreis" : ["beverages" , "cosmetics", "snacks"]})

In [9]:
df

   price  Quantity categoreis
0     20         2  beverages
1     30         3  cosmetics
2     40         4     snacks

In [14]:
a=df.assign(revenue=df['price']*df['Quantity'])

In [15]:
a

   price  Quantity categoreis  revenue
0     20         2  beverages       40
1     30         3  cosmetics       90
2     40         4     snacks      160

In [21]:
a['new']=a['categoreis'].map(lambda x: x[ 0:3])

In [22]:
a

   price  Quantity categoreis  revenue  new
0     20         2  beverages       40  bev
1     30         3  cosmetics       90  cos
2     40         4     snacks      160  sna

In [27]:
b=a.drop('categoreis', axis =1)
a

   price  Quantity categoreis  revenue  new
0     20         2  beverages       40  bev
1     30         3  cosmetics       90  cos
2     40         4     snacks      160  sna

In [28]:
b

   price  Quantity  revenue  new
0     20         2       40  bev
1     30         3       90  cos
2     40         4      160  sna